artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 10
    - duration: 30
      arrivalRate: 10
      rampTo: 20
    - duration: 30
      arrivalRate: 20
      rampTo: 30
    - duration: 30
      arrivalRate: 30
      rampTo: 50
    - duration: 30
      arrivalRate: 50
      rampTo: 75
    - duration: 30
      arrivalRate: 75
      rampTo: 100
  http:
    timeout: 10
  payload: 
    path: "queries.csv"
    fields: 
      - "query"
scenarios:
  - name: "Collect tweets from database using query string"
    flow:
    - get:
        url: "/twitter/{{ query }}"