artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 10
    - duration: 30
      arrivalRate: 20
    - duration: 30
      arrivalRate: 30
  http:
    timeout: 10
  payload: 
    path: "queries.csv"
    fields: 
      - "query"
scenarios:
  - name: "Collect tweets from database using query string"
    flow:
    - get:
        url: "/twitter/{{ query }}"