artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 10
    - duration: 300
      arrivalRate: 100
  payload: 
    path: "queries.csv"
    fields: 
      - "query"
scenarios:
  - name: "Collect tweets from database using query string"
    flow:
    - get:
        url: "/twitter/{{ query }}"